// 工具函数可以写在这里

/**
 * 正则表达式
 */
export const regular = {
  phone: /^1(3\d|4[5-9]|5[0-35-9]|6[2567]|7[0-8]|8\d|9[0-35-9])\d{8}$/,
  email: /\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*/,
  idCard: /^([1-6][1-9]|50)\d{4}(18|19|20)\d{2}((0[1-9])|10|11|12)(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
  // 不能输入特殊字符，只能输入数字、字母、中文、下划线、中划线
  specialCharacter: /^[A-Za-z0-9\u4e00-\u9fa5\-_]+$/,
  // 密码必须包含字母、数字、特殊字符，长度6-12位
  password: /^(?=.*[a-zA-Z])(?=.*\d)(?=.*[~!@#$%^&*()_+`\-={}:;'&lt;>?,.\/]).{6,12}$/,
};
